
public class Constructor1 {

	public static void main(String[] args) {
		/*
		 * 构造方法作用：创建对象，完成对象属性的初始化工作
		 * 
		 * 语法结构：
		 * public 类名 (形参列表){
		 * 		方法体-->完成初始化工作-->对属性进行赋值
		 * }
		 * 注意：
		 *  1.任何一个java类都会默认拥有
            2.一旦创建有参的构造方法后，不创建无参构造方法
            	默认的无参构造方法会失效
            3.有参和无参构造方法必须同时出现或消失
            
		    构造方法与普通方法区别：
		    1.方法名称：前者与类名一致，后者避免与类名重名
		    2.返回值：前者没有返回值，后者必须拥有
		    3.修饰符：前者没有，后者可以有
		    4.作用：前者创建对象，后者完成相应需求
		    
		    构造方法的重载：
		    	特点：方法名一致，形参列表不一致
		    	形参列表：参数个数不一致,数据类型不一致,顺序不一致
		    
		   this关键字：当前对象的引用 
		 * */
	}

}
